In [1]:
import sqlite3
import pandas as pd

In [2]:
pd.options.display.max_columns = None
#pd.options.display.max_rows = None

In [3]:
conn = sqlite3.connect('parch-and-posey.db')

In [4]:
cursor = conn.cursor()
cursor.execute('''
select * from sqlite_master where type = "table";
''')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
cursor.close()

In [5]:
pd.DataFrame(data, columns=columns)

,type,name,tbl_name,rootpage,sql
0,table,web_events,web_events,2,"CREATE TABLE web_events (\tid integer,\taccoun..."
1,table,sales_reps,sales_reps,7,"CREATE TABLE sales_reps (\tid integer,\tname b..."
2,table,region,region,222,"CREATE TABLE region (\tid integer,\tname bpchar)"
3,table,orders,orders,223,"CREATE TABLE orders (\tid integer,\taccount_id..."
4,table,accounts,accounts,583,"CREATE TABLE accounts (\tid integer,\tname bpc..."

Task 1:

# Creating a Running Total Using Window Functions
Using Derek's previous video as an example, create another running total. This time, create a running total of standard_amt_usd (in the orders table) over order time with no date truncation. Your final table should have two columns: one with the amount being added for each new row, and a second with the running total.

In [6]:
pd.read_sql_query(sql='''
SELECT standard_amt_usd, SUM(standard_amt_usd) OVER (ORDER BY occurred_at) running_total
FROM  orders;
''', con=conn)

      standard_amt_usd  running_total
0                 0.00           0.00
1              2445.10        2445.10
2              2634.72        5079.82
3                 0.00        5079.82
4              2455.08        7534.90
...                ...            ...
6907              0.00     9668015.22
6908           2480.03     9670495.25
6909            189.62     9670684.87
6910           1452.09     9672136.96
6911            209.58     9672346.54

[6912 rows x 2 columns]

Solution:

SELECT standard_amt_usd,
       SUM(standard_amt_usd) OVER (ORDER BY occurred_at) AS running_total
FROM orders

In [7]:
pd.read_sql_query(sql='''SELECT SUM(standard_amt_usd) FROM  orders;''', con=conn)

   SUM(standard_amt_usd)
0             9672346.54